/*2. Напишіть програму, яка оголошує константний вказівник на постійне ціле значення.
Ініціалізуйте цей вказівник, щоб він вказав на цілісну змінну varOne.
Надайте змінній varOne значення 6.
Використовуйте вказівник, щоб, присвоїти змінній varOne значення 7.
Створіть другу цілочисленну змінну varTwo. Перепризначте вказівник,
щоб він вказував на змінну varTwo. Поки не компілюйте цю вправу.

3. Скомпілюйте програму, написану у вправі 2. 
Які дії компілятор вважає помилковими? Які рядки генерують попередження?*/

/*

#include <iostream>
using namespace std;

int main()
{
	int varOne;
	const int *const pA = &varOne;

	varOne = 6;

	*pA = 7; //компілятор генерує помилку, не можна змінювати константу

	int varTwo;
	pA = &varTwo; //компілятор генерує помилку, не можна перевизначати константу

	return 0;
}

*/
