/*6. Баги: знайдіть помилку у наведеному фрагменті програми.
counetr - невірна назва змінної
counetr: двокрапка непотрібна, потрібна крапка з комою
треба змінювати лічильник
*/

// int counter = 0;
// while (counter < 10)
// {
// 	cout << "counter: " << counetr:
// }

/*7. Баги: знайдіть помилку у наведеному фрагменті програми.
counter < 10:   повинна бути крапка з комою вкінці
якщо потрібно вивести cout << counter << " ", то потрібно обгорнути це у {} 
та убрати крапку з комою після for (int counter = 0; counter < 10: counter++);
*/

// for (int counter = 0; counter < 10: counter++);
// 	cout << counter << " ";

/*8. Баги: знайдіть помилку у наведеному фрагменті програми.
counter < 10  умова повинна бути counter > 10
*/

// int counter = 100;
// while (counter < 10)
// {
// 	cout << "counter now: " << counter;
// 	counter--;
// }

